{
  "major_name": "Earth, Society, & Environmental Sustainability, BSLAS",
  "url": "https://catalog.illinois.edu/undergraduate/las/earth-society-environmental-sustainability-bslas/",
  "sections": {
    "sample_sequence": [
      {
        "type": "paragraph",
        "content": "for the degree of Bachelor Science in Liberal Arts and Sciences Major in Earth, Society, & Environmental Sustainability"
      },
      {
        "type": "heading",
        "level": "h2",
        "content": "Sample Sequence"
      },
      {
        "type": "paragraph",
        "content": "This sample sequence is intended to be used only as a guide for degree completion. All students should work individually with their academic advisors to decide the actual course selection and sequence that works best for them based on their academic preparation and goals. Enrichment programming such as study abroad, minors, internships, and so on may impact the structure of this four-year plan. Course availability is not guaranteed during the semester indicated in the sample sequence."
      },
      {
        "type": "paragraph",
        "content": "Students must fulfill their Language Other Than English requirement by successfully completing a fourth level of a language other than English. This may require up to four semesters of language depending on high school coursework or placement. See the corresponding section on the Degree and General Education Requirements page."
      }
    ],
    "learning_outcomes": [
      {
        "type": "paragraph",
        "content": "for the degree of Bachelor Science in Liberal Arts and Sciences Major in Earth, Society, & Environmental Sustainability"
      },
      {
        "type": "list",
        "list_type": "ol",
        "content": [
          "Be able to recognize, critique and implement commonly accepted Sustainability models and ideas in a wide variety of settings, using systems thinking to link social and natural science concepts.",
          "Have a fundamental understanding of the underlying natural science (SES concentration) or social science (SAE concentration) concepts; being able to recognize and apply appropriate scientific methods (SES concentration) and social science methods (SAE concentration).",
          "Use quantitative methods to describe, understand and evaluate theoretical and applied issues in environmental and sustainability study; this includes direct calculation, working with data, and using quantitative models.",
          "Be able to critically evaluate and then communicate environmental and sustainability concepts to both specialized and wide audiences.",
          "Prepare students for professional work in environmental and sustainability practice, such as laboratory and field techniques, apprehending and implementing Geographic Information Sciences (including the use of appropriate software), and quantitative and qualitative methods."
        ]
      }
    ],
    "contact_information": [
      {
        "type": "paragraph",
        "content": "for the degree of Bachelor Science in Liberal Arts and Sciences Major in Earth, Society, & Environmental Sustainability"
      },
      {
        "type": "paragraph",
        "content": "Earth, Society & Environment website \nEarth, Society & Environment faculty\nEarth, Society & Environment advising"
      },
      {
        "type": "paragraph",
        "content": "Overview of College Admissions & Requirements: Liberal Arts & Sciences\nCollege of Liberal Arts and Sciences website"
      }
    ]
  }
}