{
  "major_name": "Psychology, BSLAS",
  "url": "https://catalog.illinois.edu/undergraduate/las/psychology-bslas/",
  "sections": {
    "learning_outcomes": [
      {
        "type": "paragraph",
        "content": "for the degree of Bachelor of Science in Liberal Arts & Sciences Major in Psychology"
      },
      {
        "type": "paragraph",
        "content": "The student learning outcomes are adapted from the American Psychological Association’s (APA) “Guidelines for the Undergraduate Psychology Major” (2013). These guidelines consist of general learning outcomes along with specific indicators that can be assessed. Two sets of indicators are provided by the APA depending on whether a student has completed just the foundational courses (100‐ and 200‐ level classes) or is finishing the elective courses (300‐ and 400‐ level classes) necessary for each concentration within the Psychology major. The four learning outcomes that we will be evaluating are:"
      },
      {
        "type": "list",
        "list_type": "ol",
        "content": [
          "Students will demonstrate fundamental knowledge and comprehension of the major concepts, theoretical perspectives, historical trends, and empirical findings to discuss how psychological principles apply to behavioral phenomena. This includes 1.1) describing key concepts, principles and overarching themes, 1.2) developing a working knowledge of the different content or program areas in psychology, and 1.3) describing the application of psychology to everyday life.",
          "Students will develop scientific reasoning and problem solving skills, including effective research methods. This includes 2.1) using scientific reasoning to interpret psychological phenomena; 2.2) demonstrating psychology information literacy; 2.3) engaging in innovative and integrative thinking and problem solving; 2.4) interpreting, designing, and conducting basic psychological research; and 2.5) incorporating sociocultural factors in scientific inquiry when appropriate.",
          "Students will develop ethically and socially responsible behaviors for professional and personal settings in a landscape that involves increasing diversity. This goal encompasses 3.1) applying ethical standards to evaluate psychological science and practice; 3.2) building and enhancing interpersonal relationships; and 3.3) adopting values that build community at local, national, and global levels.",
          "Students will be prepared to apply psychology‐specific content and skills, effective self-reflection, project‐management skills, teamwork skills, and career preparation to optimize their competitiveness for securing places in a graduate school, professional school, or in the workforce. For example, students should be able to 4.1) apply psychological content and skills to career goals; 4.2) demonstrate project‐management skills and teamwork capacity; and 4.3) develop meaningful professional direction for life after graduation."
        ]
      }
    ],
    "contact_information": [
      {
        "type": "paragraph",
        "content": "for the degree of Bachelor of Science in Liberal Arts & Sciences Major in Psychology"
      },
      {
        "type": "paragraph",
        "content": "Department of Psychology website"
      },
      {
        "type": "paragraph",
        "content": "Psychology faculty"
      },
      {
        "type": "paragraph",
        "content": "Psychology advising"
      },
      {
        "type": "paragraph",
        "content": "Overview of College Admissions & Requirements: Liberal Arts & Sciences"
      },
      {
        "type": "paragraph",
        "content": "College of Liberal Arts and Sciences website"
      },
      {
        "type": "paragraph",
        "content": "Psychology email"
      }
    ]
  }
}